frontend/views/layouts/side-bar.php

$base_url = Yii::$app->request->baseUrl;
$role = Yii::$app->user->identity->role_type;
$base = Yii::$app->controller->id . "/" . Yii::$app->controller->action->id;
$name = User::findOne(['id' => Yii::$app->user->identity->id]);
---
SELECT * FROM `user` WHERE `id`=16

            </div>
            <div class="pull-left info">
                <p><?= $name->first_name . ' ' . ucfirst($name->last_name); ?></p>
                <p>(<?= MasterRoleTypes::findOne(['id' => Yii::$app->user->identity->role_type])->role_name; ?>)</p>
---
SELECT * FROM `master_role_types` WHERE `id`=7